{
  "alpha": { "branch": "main" },
  "autopairs": { "branch": "master" },
  "autotag": { "branch": "main" },
  "catppuccin": { "branch": "main" },
  "cmp": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-lsp": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "codesnap": { "branch": "main" },
  "colorizer": { "branch": "master" },
  "devicon-auto-colors": { "branch": "main" },
  "devicons": { "branch": "master" },
  "diffview": { "branch": "main" },
  "gitsigns": { "branch": "main" },
  "harpoon": { "branch": "harpoon2" },
  "indent-blankline": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lspconfig": { "branch": "master" },
  "lspkind": { "branch": "master" },
  "lualine": { "branch": "master" },
  "luasnip": { "branch": "master" },
  "mason": { "branch": "main" },
  "mason-lsp": { "branch": "main" },
  "neogit": { "branch": "master" },
  "neotree": { "branch": "main" },
  "noice": { "branch": "main" },
  "notify": { "branch": "master" },
  "nui": { "branch": "main" },
  "obsidian": { "branch": "main" },
  "plenary": { "branch": "master" },
  "telescope": { "branch": "master" },
  "telescope-fzf": { "branch": "main" },
  "tmux-navigation": { "branch": "main" },
  "todo": { "branch": "main" },
  "treesitter": { "branch": "master" },
  "undotree": { "branch": "master" },
  "which-key": { "branch": "main" }
}